Repository: Ishtef/notepadPlusPlusAccessEnhancementNVDAAddon
Catalog: addon/locale/*/LC_MESSAGES/nvda.po
Languages: ar, uk

source: Notepad++ text's editor : accessibility enhancement
ar: تحسين إمكانية الوصول:لمحرر النصوص Notepad ++
uk: Текстовий редактор Notepad++ : покращення доступності

source: 1- Features # This extension aims to improve the accessibility of the Notepad++ text editor and add functionalities to facilitate the editing of files used in Python language and files written in markdown language. It includes most of the additions made by NVDA_notepadPlusPlus add-on created by Derek Riemer and Tuukka Ojala, then modified by Robert Hanggi and Andre9642 <https://github.com/derekriemer/nvda-notepadPlusPlus>. To know: * vocalization of the result of the "control + b" command which allows you to move to the symmetric delimiter, * vocalization of the movement to the next or previous bookmark with "F2" or "capital letter + f2", * reporting of lines that are too long, * accessibility to autocomplete, * accessibility to incremental search, * Support for previous / next search function. For Python files, it provides: * move to the next class or method, * importing the code from the editing window. For Markdown or txt2tags files: * preview of the result of the conversion to HTML in the virtual buffer of NVDA or in the default browser, * added browse mode commands for title, link, blocquote. And finally: * Announcement of the number and indentation of each line, * scripts to set the indentation, * Focus movement displacement by "home" key, * Comparison of the selected text with that of the clipboard, * go to the next line ending with at least one tab or one space, * format of the announcement of the name of the documents: * reduced file path announcement, * announcement of the name of the file before its path, * no diction of path's backslashs. 2- Compatibility This extension has been tested with Notepad++ version 8.4.2. 3- Constraints This extension uses and intercepts the shortcuts of Notepad++ configured by default. It is therefore strongly advised, for its proper functioning, not to modify these shortcuts.
uk: 1- Можливості # Цей додаток має на меті покращити доступність текстового редактора Notepad++ та додати функціональність для полегшення редагування файлів, написаних мовою Python, а також файлів, написаних мовою розмітки markdown. Він містить більшість покращень від додатка NVDA_notepadPlusPlus, який створили Дерек Рімер (Derek Riemer) і Туукка Ояла (Tuukka Ojala), а потім модифікували Роберт Ханггі (Robert Hanggi) і Андре9642 <https://github.com/derekriemer/nvda-notepadPlusPlus>. а саме: * озвучення результату виконання команди "control + b", яка дозволяє перейти до симетричного роздільника, * озвучення переходу до наступної або попередньої закладки за допомогою "F2" або "Shift+f2", * Інформування про надто довгі рядки, * доступність автозаповнення, * доступність покрокового пошуку, * підтримка функції попереднього/наступного пошуку. Для файлів на мові Python забезпечує: * перехід до наступного класу або методу, * імпорт коду з вікна редагування. Для файлів Markdown або txt2tags: * попередній перегляд результату перетворення в HTML у віртуальному буфері NVDA або в типовому браузері, * додані команди режиму огляду для заголовків, посилань і цитат. І нарешті: * інформування про номер та відступ кожного рядка, * сценарії для встановлення відступів, * переміщення фокуса за допомогою клавіші "home", * порівняння виділеного тексту з текстом у буфері обміну, * перехід до наступного рядка, що закінчується принаймні одним знаком табуляції або одним пробілом, * формат оголошення назв документів: * стисле оголошення файлового шляху, * оголошення спочатку імені файлу, а потім його шляху, * ігнорування знаків скісної риски у шляху. 2- Сумісність Цей додаток було протестовано з Notepad++ версії 8.4.2. 3- Обмеження Цей додаток використовує та перехоплює типові гарячі клавіші Notepad++. Тому для його належного функціонування наполегливо рекомендується не змінювати їх.

source: Do you want to keep current add-on configuration settings ?
uk: Бажаєте зберегти поточні налаштування параметрів додатка?

source: %s - installation
uk: %s - встановлення

source: Are you sure you don't want to keep the current add-on configuration settings?
uk: Ви впевнені, що не бажаєте зберегти поточні налаштування параметрів додатка?

source: Say indent
ar: قُل مسافة بادئة
uk: Зазначати відступ

source: Say indent changes
ar: قُل تغيير المسافة البادئة
uk: Зазначати зміни відступу

source: Say level
ar: قل المستوى
uk: Зазначати зміни відступу у формі рівнів

source: Say level changes
ar: قل تغييرات المستوى
uk: Зазначати зміни відступу у формі вищого або нижчого рівня

source: Say nothing
ar: لا تقل شيء
uk: Не зазначати нічого

source: Path
uk: Шлях

source: Type
uk: Тип

source: Size
uk: Розмір

source: The configuration file of the add-on contains errors. The configuration has been reset to factory defaults
uk: Файл конфігурації додатка містить помилки. Параметри скинуто до початкових налаштувань

source: Warning
uk: УВАГА

source: Informations
ar: معلومات
uk: Інформація

source: Co&py to Clipboard
ar: &نسخ إلى الحافظة
uk: &Копіювати в буфер обміну

source: Copied
ar: نسخ
uk: Скопійовано

source: Error, the information cannot be copied to the clipboard
ar: خطأ ، لا يمكن نسخ المعلومات إلى الحافظة
uk: Помилка, інформацію неможливо скопіювати в буфер обміну

source: %s dialog is allready open
ar: حوار %s مفتوح بالفعل
uk: %s діалог вже відкрито

source: {addonSummary}'s add-on - {dialogTitle}
ar: الوظيفة الإضافية لـ {addonSummary} - {DialTitle}
uk: Додаток {addonSummary} – {dialogTitle}

source: Toggle line number and indentation's announcement management by add-on
ar: تبديل رقم السطر وإدارة إعلان المسافة البادئة عن طريق الوظيفة الإضافية
uk: Вмикає/вимикає оголошення додатком номерів та відступів рядків

source: Line number and indentation's announcement by add-on
ar: رقم السطر وإعلان المسافة البادئة عن طريق الوظيفة الإضافية
uk: Оголошення номера рядка та відступу здійснюється додатком

source: Line number and indentation's announcement by NVDA
ar: إعلان رقم السطر والمسافة البادئة من قِبَل NVDA
uk: Оголошення номера рядка та відступу здійснюється NVDA

source: clipboard is empty
ar: الحافظة فارغة
uk: буфер обміну порожній

source: no selection
ar: لا يوجد تحديد
uk: немає виділення

source: Toggle line indentation reporting
ar: تبديل الإبلاغ عن المسافة البادئة للسطر
uk: Перемикає інформування про відступ рядка

source: Impossible, the number and the indentation of the lines are not announced by the extension
ar: إستحالة ، لا يتم الإعلان عن عدد الأسطر والمسافة البادئة لها بواسطة الامتداد
uk: Неможливо, номер та відступ рядків не оголошуються додатком

source: Choose line indentation announcement's format
ar: اختر تنسيق إعلان المسافة البادئة للسطر
uk: Вибирає формат інформування про відступ рядка

source: The increment is %s spaces
ar: الزيادة هي %s مسافات
uk: Крок становить %s пробілів

source: The increment is %s Tab
ar: الزيادة هي علامة التبويب %s
uk: Крок становить %s табів

source: Activate/desactivate the line number's announcement
ar: تنشيط / إلغاء تنشيط إعلان رقم الخط
uk: Перемикає оголошення номера рядка

source: Say line number
ar: قل رقم السطر
uk: Промовляти номер рядка

source: Don't say line number
ar: لا تقل رقم السطر
uk: Не промовляти номера рядка

source: Toggle report spelling errors option
uk: Перемикає опцію інформування про орфографічні помилки

source: Report spelling errors
uk: Інформувати про орфографічні помилки

source: Don't report spelling errors
uk: Не інформувати про орфографічні помилки

source: Documents {index} on {total}
ar: المستندات {index} على {total}
uk: Документ {index} з {total}

source: block quote
ar: اقتباس كتلة
uk: цитата

source: Extended browse mode for Notepad++
ar: وضع التصفح الموسع لبرنامج Notepad ++
uk: Розширений режим огляду для Notepad++

source: Go to next line that is exceeds the maximum line length
ar: انتقل إلى السطر التالي الذي يتجاوز الحد الأقصى لطول السطر
uk: Переходить до наступного рядка з надмірною довжиною

source: no next long line
uk: більше немає довгих рядків

source: Go to previous line that is exceeds the maximum line length
ar: انتقل إلى السطر السابق الذي يتجاوز الحد الأقصى لطول السطر
uk: Переходить до попереднього рядка з надмірною довжиною

source: no previous long line
uk: більше немає довгих рядків

source: It seems the document is a t2t document. Do you want to continue to treate as markdown ?
ar: يبدو أن المستند عبارة عن مستند t2t. هل تريد الاستمرار في التعامل مع markdown ?
uk: Здається, документ є документом t2t. Ви хочете продовжити його обробку як markdown?

source: %s - warning
ar: %s - تحذير
uk: %s - попередження

source: Preview of MarkDown or HTML
ar: معاينة MarkDown أو HTML
uk: Попередній перегляд MarkDown або HTML

source: The target(%s) is not HTML
ar: الهدف (%s) ليس HTML
uk: Ціль (%s) не є HTML

source: Cannot compile text with txt2tags
ar: لا يمكن ترجمة نص باستخدام txt2tags
uk: Неможливо скомпілювати текст за допомогою txt2tags

source: Preview of txt2tags or HTML
ar: معاينة txt2tags أو HTML
uk: Попередній перегляд txt2tags або HTML

source: Convert to HTML
ar: تحويل إلى HTML
uk: Перетворити в HTML

source: &Treate with:
ar: &التعامل مع:
uk: &Обробити як:

source: &Display the result in the navigator
ar: &عرض النتيجة عند التنقل
uk: &Показати результат у браузері

source: Start of line
ar: بداية السطر
uk: Початок рядка

source: Move to previous line with only tab or space
ar: الانتقال إلى السطر السابق بعلامة تبويب أو مسافة فقط
uk: Переходить до попереднього рядка, що складається лише з табуляцій або пробілів

source: Move to next line with only tab or space
ar: الانتقال إلى السطر التالي بعلامة تبويب أو مسافة فقط
uk: Переходить до наступного рядка, що складається лише з табуляцій або пробілів

source: Move to next line ending with tab or space character
ar: الانتقال إلى السطر التالي الذي ينتهي بعلامة جدولة أو حرف مسافة
uk: Переходить до наступного рядка, що закінчується табуляцією або пробілом

source: Move to previous line ending with tab or space character
ar: الانتقال إلى السطر السابق المنتهي بعلامة جدولة أو حرف مسافة
uk: Переходить до попереднього рядка, що закінчується табуляцією або пробілом

source: Move to next python class
ar: انتقل إلى فئة بيثون التالية class
uk: Переходить до наступного класу python

source: Move to previous python class
ar: انتقل إلى فئة بايثون السابقة class
uk: Переходить до попереднього класу python

source: Move to next python method
ar: انتقل إلى طريقة البايثون التالية method
uk: Переходить до наступного методу python

source: Move to previous python method
ar: انتقل إلى طريقة البايثون السابقة method
uk: Переходить до попереднього методу python

source: Move to next python class or method
ar: انتقل إلى فئة أو طريقة بيثون التالية
uk: Переходить до наступного класу або методу python

source: Move to previous python class or method
ar: انتقل إلى فئة أو طريقة بايثون السابقة
uk: Переходить до попереднього класу або методу python

source: Delete indentation
ar: حذف المسافة البادئة
uk: Видаляє відступ

source: Set the indentation to level {level} ({level} tabs)
ar: تعيين المسافة البادئة للمستوى {level} ({level} tabs)
uk: Встановлює рівень відступу {level} ({level} табів)

source: Set the indentation to level 1(1 tab)
ar: اضبط المسافة البادئة على المستوى 1 (علامة تبويب واحدة)
uk: Встановлює рівень відступу 1 (1 таб)

source: No more bookmark
ar: لا مزيد منالعلامات المرجعية
uk: Більше немає закладок

source: Toggle long line indicator
ar: تبديل مؤشر الخط الطويل
uk: Перемикання індикатора довгого рядка

source: Report Long lines
ar: الإبلاغ عن الأسطر الطويلة
uk: Інформувати про довгі рядки

source: Don't report long lines
ar: لا تبلغ عن الأسطر الطويلة
uk: Не інформувати про довгі рядки

source: Moves to the first character that is after the maximum line length
ar: للانتقال إلى الحرف الأول بعد الحد الأقصى لطول السطر
uk: Переходить до першого символу після максимальної довжини рядка

source: Report current caret position. Twice: report number of selected characters
ar: الإبلاغ عن موضع علامة الإقحام الحالية. مرتين: الإبلاغ عن عدد الأحرف المحددة
uk: Інформує про поточну позицію курсора. Двічі: інформує про кількість вибраних символів

source: line {0}, column {1}
ar: السطر {0} ، العمود {1}
uk: рядок {0}, стовпець {1}

source: %s characters selectionned
ar: تم تحديد %s من الأحرف
uk: Вибрано %s символів

source: one character selected
ar: تم تحديد حرف واحد
uk: вибрано один символ

source: %s lines
ar: %s سطر
uk: %s рядках

source: one line
ar: سطر واحد
uk: одному рядку

source: {0} selected on {1}
ar: تم تحديد {0} في {1}
uk: {0} у {1}

source: No more search results in this direction
ar: لا مزيد من نتائج البحث في هذا الاتجاه
uk: В цьому напрямку більше немає результатів пошуку

source: Open the dialog to Treat the edit window content as MarkDown or txt2tags document and display it as webpage in the internal or external default browserTwice: treate with last selected parameters.
ar: افتح مربع الحوار لمعالجة محتوى نافذة التحرير كمستند MarkDown أو txt2tags وعرضه كصفحة ويب في المستعرض الافتراضي الداخلي أو الخارجي مرتين: تعامل مع المعلمات المحددة الأخيرة.
uk: Відкриває діалог Обробки вмісту вікна редагування як документу MarkDown або txt2tags і показує його як вебсторінку у внутрішньому або зовнішньому стандартному браузері. Двічі: обробляє з останніми вибраними параметрами.

source: Compare selected text to text in clipboard
ar: قارن النص المحدد بالنص في الحافظة
uk: Порівнює виділений текст із текстом у буфері обміну

source: Differences between selected text and text in clipboard
ar: الاختلافات بين النص المحدد والنص في الحافظة
uk: Відмінності між виділеним текстом і текстом у буфері обміну

source: Import document's text as a Python module
ar: استيراد نص المستند كوحدة Python
uk: Імпортує текст документа як модуль Python

source: python code imported without error
ar: تم استيراد كود python بدون أخطاء
uk: код python імпортовано без помилок

source: Unable to determine document type: markdown or txt2tags
ar: تعذر تحديد نوع المستند: markdown أو txt2tags
uk: Не вдається визначити тип документа: markdown або txt2tags

source: Line
ar: سطر
uk: Рядок

source: Document
ar: المساعدة
uk: Документ

source: Unknow level
ar: مستوى غير معروف
uk: Невідомий рівень

source: Level
ar: مستوى
uk: Рівень

source: Higher level
ar: مستوى أعلى
uk: Вищий рівень

source: Lower level
ar: مستوى أقل
uk: Нижчий рівень

source: No indent
ar: بدون مسافة بادئة
uk: Немає відступу

source: Attention, mixture of spaces and tab
ar: الانتباه ، مزيج من الفراغات وعلامة التبويب
uk: Увага, поєднання пробілів і табуляцій

source: column %s
ar: العمود %s
uk: стовпець %s

source: After
ar: بعد
uk: Після

source: Line cannot be reported
ar: لا يمكن الإبلاغ عن السطر
uk: Неможливо інформувати про рядок

source: No other class
ar: لا توجد فئة أخرى
uk: Немає іншого класу

source: No other method
ar: لا توجد طريقة أخرى
uk: Немає іншого методу

source: No other class or method
ar: لا توجد فئة أو طريقة أخرى
uk: Немає іншого класу чи методу

source: No more long line
ar: لا أسطر طويلة
uk: Більше немає довгих рядків

source: No more line with only tab or space
ar: لا مزيد من الأسطر مع علامة التبويب أو المسافة فقط
uk: Більше немає рядків, що складаються лише з табуляцій або пробілів

source: No more line ending with tab or space
ar: لا مزيد من الأسطر التي تنتهي بعلامة جدولة أو مسافة
uk: Більше немає рядків, що закінчуються табуляцією чи пробілом

source: General
ar: عام
uk: Загальні

source: Show autocomplete &suggestions in braille
ar: إظهار الإكمال التلقائي والاقتراحات بطريقة برايل
uk: Показувати &пропозиції автозаповнення шрифтом Брайля

source: Documents's name
ar: اسم المستندات
uk: Ім'я документа

source: &Say file name before path
ar: &قل اسم الملف قبل المسار
uk: &Промовляти спочатку ім'я файлу, потім шлях

source: Say the path &going up the folder tree
uk: Промовляти шлях, піднімаючись по &дереву папок

source: &Reduce path
ar: & تصغير المسار
uk: &Зменшити шлях

source: &Don't say backslash of path
ar: &لا تقل الشرطة المائلة للخلف للمسار
uk: &Не промовляти зворотних скісних рисок

source: Reduced path announcement
uk: Стислий файловий шлях

source: &Previous hierarchical levels to keep
ar: & المستويات الهرمية السابقة للاحتفاظ بها
uk: &Кількість попередніх рівнів, які зберігатимуться

source: Reversed file path announcement
uk: Оголошення зворотного шляху до файлу

source: Do not say the &hierarchical levels
uk: Не вказувати &ієрархічні рівні

source: Documents dialog
uk: Діалог документи

source: &Select elements of the document that should be spoken with its name:
uk: &Виберіть елементи документа, які мають промовлятися разом з його назвою:

source: &Let NVDA announce the line number and indentations
ar: &ليعلن NVDA عن رقم السطر والمسافات البادئة
uk: &Дозволити NVDA оголошувати номери та відступи рядків

source: &Report line number
ar: & الإبلاغ عن رقم السطر
uk: &Інформувати про номер рядка

source: Line indentation
ar: مسافة بادئة للسطر
uk: Відступ рядка

source: Report line &indentation
ar: الإبلاغ عن ال&سطر والمسافة البادئة
uk: Інформувати про відступ &рядка

source: St&yle:
ar: نم&ط:
uk: С&тиль:

source: Long line
ar: سطر طويل
uk: Довгий рядок

source: Rep&ort long lines
ar: الإ&بلاغ عن الأسطر الطويلة
uk: &Виявляти занадто довгі рядки

source: &Minimum line length:
ar: &الحد الأدنى لطول الخط:
uk: &Мінімальна довжина довгого рядка:

source: Update
ar: تحديث
uk: Оновлення

source: Automatically check for &updates
ar: ال&بحث تلقائيا عن التحديثات
uk: Автоматично перевіряти &оновлення

source: Update also release versions to &developpement versions
ar: &قم بالتحديث الى إصدارات التطوير والمراجعات
uk: Оновлювати стабільні версії до версій у &розробці

source: &Check for update
ar: البحث عن تحدي&ث
uk: &Перевірити оновлення

source: View &history
ar: عرض الس&جل
uk: Переглянути &історію

source: Settings
ar: الإعدادات
uk: Налаштування

source: The update is not compatible with this version of NVDA. Minimum NVDA version: {minYear}.{minMajor}, last tested: {testedYear}.{testedMajor}.
uk: Оновлення несумісне з цією версією NVDA. Мінімальна версія NVDA: {minYear}.{minMajor}, Востаннє протестовано: {testedYear}.{testedMajor}.

source: Downloading {name}
ar: تنزيل {name}
uk: Завантаження {name}

source: Error downloading update for {name}.
ar: خطأ في تنزيل التحديث لـ {name}.
uk: Помилка завантаження оновлення для {name}.

source: Cannot update {name} - missing file or invalid file format
ar: لا يمكن تحديث {name} - ملف مفقود أو تنسيق ملف غير صالح
uk: Не вдалося оновити {name} - файл відсутній або має неприпустимий формат

source: Updating
ar: جاري التحديث
uk: Оновлення

source: Please wait while the add-on is being updated.
ar: الرجاء الانتظار بينما يتم تحديث الوظيفة الإضافية.
uk: Будь ласка, зачекайте, доки додаток оновлюється.

source: Failed to update {name} add-on
ar: فشل تحديث الوظيفة الإضافية {name}
uk: Не вдалося оновити додаток {name}

source: {summary} - update
ar: {summary} - تحديث
uk: {summary} - оновлення

source: The service is temporarily under maintenance. Please, try again later.
ar: الخدمة تحت الصيانة مؤقتا. الرجاء معاودة المحاولة في وقت لاحق.
uk: Сервіс тимчасово не працює. Будь ласка, спробуйте пізніше.

source: New version%s is available. Do you want to download it now?
uk: Доступна нова версія%s. Бажаєте завантажити її зараз?

source: You are up-to-date. %s is the latest version.
ar: لا يوجد تحديث %sأحدث إصدار
uk: У вас актуальна версія. %s - остання версія.

source: Oops! There was a problem checking for updates. Please retry later
ar: يا الله! هناك مشكلة في التحقق من وجود تحديثات. الرجاء إعادة المحاولة لاحقًا
uk: Упс! Виникла проблема з перевіркою оновлень. Будь ласка, спробуйте пізніше

source: &Yes
ar: &نعم
uk: &Так

source: &No
ar: &لا
uk: &Ні

source: &Later
ar: لا&حقاً
uk: &Пізніше

source: Wha&t's new
ar: &ما هو الجديد
uk: Що &нового

source: 1- Features # This extension aims to improve the accessibility of the Notepad ++ text editor and add functionalities to facilitate the editing of files used in Python language and files written in markdown language. It includes most of the additions made by NVDA_notepadPlusPlus add-on created by Derek Riemer and Tuukka Ojala, then modified by Robert Hanggi and Andre9642 <https://github.com/derekriemer/nvda-notepadPlusPlus>. To know: * vocalization of the result of the "control + b" command which allows you to move to the symmetric delimiter, * vocalization of the movement to the next or previous bookmark with "F2" or "capital letter + f2", * reporting of lines that are too long, * accessibility to autocomplete, * accessibility to incremental search, * Support for previous / next search function. For Python files, it provides: * move to the next class or method, * importing the code from the editing window. For Markdown or txt2tags files: * preview of the result of the conversion to HTML in the virtual buffer of NVDA or in the default browser, * added browse mode commands for title, link, blocquote. And finally: * Announcement of the number and indentation of each line, * scripts to set the indentation, * Focus movement displacement by "home" key, * Comparison of the selected text with that of the clipboard, * go to the next line ending with at least one tab or one space, * format of the announcement of the name of the documents: * reduced file path announcement, * announcement of the name of the file before its path, * no diction of path's backslashs. 2- Compatibility This extension has been tested with Notepad ++ version 7.91. 3- Constraints This extension uses and intercepts the shortcuts of Notepad ++ configured by default. It is therefore strongly advised, for its proper functioning, not to modify these shortcuts.
ar: 1- الميزات # يهدف هذا الامتداد إلى تحسين إمكانية الوصول إلى محرر نصوص Notepad ++ وإضافة وظائف لتسهيل تحرير الملفات المستخدمة بلغة Python والملفات المكتوبة بلغة markdown. يتضمن معظم الإضافات التي تم إجراؤها بواسطة الوظيفة الإضافية NVDA_notepadPlusPlus التي أنشأها Derek Riemer و Tuukka Ojala ، ثم تم تعديلها بواسطة Robert Hanggi و Andre9642 <https://github.com/derekriemer/nvda-notepadPlusPlus>. لتعرف: * نطق نتيجة الأمر "control + b" الذي يسمح لك بالانتقال إلى المحدد المتماثل ، * نطق الحركة إلى الإشارة المرجعية التالية أو السابقة بـ "F2" أو "حرف كبير + f2" ، * الإبلاغ عن السطور الطويلة جداً ، * إمكانية الوصول إلى الإكمال التلقائي ، * إمكانية الوصول إلى البحث المتزايد ، * دعم وظيفة البحث السابقة / التالية. بالنسبة لملفات Python ، فإنه يوفر: * الانتقال إلى الفئة أو الطريقة التالية ، * استيراد الكود من نافذة التحرير. بالنسبة لملفات Markdown أو txt2tags: * معاينة نتيجة التحويل إلى HTML في المخزن الظاهري لـ NVDA أو في المتصفح الافتراضي ، * تمت إضافة أوامر نمط التصفح للعنوان ، الارتباط ، blocquote. وأخيرًا: * إعلان عن الرقم والمسافة البادئة لكل سطر ، * برامج نصية لتعيين المسافة البادئة ، * تركيز إزاحة الحركة عن طريق مفتاح "المنزل" ، * مقارنة النص المحدد بالنص الموجود في الحافظة ، * انتقل إلى السطر التالي الذي ينتهي بعلامة تبويب واحدة أو مسافة واحدة على الأقل ، * تنسيق الإعلان عن اسم المستندات: \ t * إعلان مسار الملف المختزل ، \ t * الإعلان عن اسم الملف قبل مساره ، \ t * لا يوجد إملاء للخط المائل العكسي للمسار. 2- التوافق تم اختبار هذا الملحق مع الإصدار 7.91 من Notepad ++. 3- القيود يستخدم هذا الامتداد واختصارات Notepad ++ التي تم تكوينها افتراضيًا. لذلك ينصح بشدة بعدم تعديل هذه الاختصارات من أجل عملها بشكل صحيح.

source: Python
ar: بايثون

source: Reduced announcement of the files's path
ar: إعلان أقل لِمسار الملفات

source: The update is not compatible with this version of NVDA. Minimum NVDA version: {minYear}{minMajor}, last tested: {testedYear}.{testedMajor}.
ar: التحديث غير متوافق مع هذا الإصدار من NVDA. الحد الأدنى لإصدار NVDA: {minYear} {minMajor} ، آخر اختبار: {testYear}. {testMajor}.

source: New version available, version %s. Do you want download it now?
ar: يتوفر إصدار جديد ، الإصدار %s. هل تريد تحميله الآن؟
